evidence/gqa-page784-k5120/final-dp2-validation/throughput/results/8-16K_c2/client.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fe37d6120e0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='/public/home/tangyu408/Qwen_DCU_Worker_0/modular_validation/results/gqa_page784_k5120_final_dp2_5355cea_20260811/throughput/data/8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=2, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='/root/Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/Qwen_DCU_Worker_0/modular_validation/results/gqa_page784_k5120_final_dp2_5355cea_20260811/throughput/results/8-16K_c2', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-0ea24dff-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 08-11 01:13:12 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:07<00:00,  3.63s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
100%|██████████| 50/50 [06:46<00:00,  8.12s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  406.05    
Total input tokens:                      664763    
Total generated tokens:                  13470     
Request throughput (req/s):              0.12      
Output token throughput (tok/s):         33.17     
Peak output token throughput (tok/s):    47.00     
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          1670.31   
---------------Time to First Token----------------
Mean TTFT (ms):                          3335.08   
Median TTFT (ms):                        3321.00   
P50 TTFT (ms):                           3321.00   
P95 TTFT (ms):                           4299.37   
P99 TTFT (ms):                           7215.05   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          43.82     
Median TPOT (ms):                        43.24     
P50 TPOT (ms):                           43.24     
P95 TPOT (ms):                           46.16     
P99 TPOT (ms):                           55.46     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.02     
Median ITL (ms):                         43.35     
P50 ITL (ms):                            43.35     
P95 ITL (ms):                            47.09     
P99 ITL (ms):                            47.73     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          15463.32  
Median E2EL (ms):                        6544.67   
P50 E2EL (ms):                           6544.67   
P95 E2EL (ms):                           47380.72  
P99 E2EL (ms):                           59515.84  
==================================================